# backend/app/cli/Woulate_import.py
import sys
from backend.app.db.session import SessionLocal
from backend.app.db.models import Woulate
from sqlalchemy import text

def extract_job_title(description: str) -> str:
    if "والي" in description:
        return "والي"
    elif "عامل" in description:
        return "عامل"
    elif "مدير" in description:
        return "مدير"
    else:
        return "غير محدد"

def import_data():
    db = SessionLocal()
    records = []

    # All records: (full_name, job_description, idara, jiha, wilaya, amala,assignment_date, assignment_year)
    appointments = [
        # === المركزية ===
        ("سمير محمد تازي", "والي كاتب عام لوزارة الداخلية", "مركزية", None, None,None, "2025-05-12", 2025),
        ("محمد فوزي", "والي مفتش عام للإدارة الترابية", "مركزية", None, None,None, "2025-05-12", 2025),
        ("حسن أغماري", "والي مدير الشؤون الانتخابية", "مركزية", None, None,None, "2025-05-12", 2025),
        ("عبد الحق الحراق", "والي مدير أنظمة المعلومات والاتصالات", "مركزية", None, None,None, "2025-05-12", 2025),
        ("عبد الله العلوي", "عامل مدير التواصل بوزارة الداخلية", "مركزية", None, None,None, "2025-05-12", 2025),
        ("جلول صمصم", "والي مدير عاما للجماعات الترابية", "مركزية", None, None,None, "2025-05-12", 2025),
        ("حسن مزغمة", "عامل مديرا للشؤون القروية", "مركزية", None, None,None, "2025-05-12", 2025),

        # === ترابية (June 2017) ===
        # نبيل خروبي عامل على عمالة مقاطعات سيدي البرنوصي عمالة الدار البيضاء جهة الدار البيضاء
        ("نبيل خروبي", "عامل على عمالة مقاطعات سيدي البرنوصي بالدار البيضاء", "ترابية", "جهة الدار البيضاء سطات", "عمالة الدار البيضاء","عمالة مقاطعات سيدي البرنوصي", "2017-06-29", 2017),

        # == ترابية (Aug 2018) ==
        #تعيين جمال مخطار عامل على عمالة مقاطعات مولاي رشيد عمالة الدار البيضاء جهة الدار البيضاء
        ("جمال مخططار", "عامل على عمالة مقاطعات مولاي رشيد بالدار البيضاء", "ترابية", "جهة الدار البيضاء سطات", "عمالة الدار البيضاء","عمالة مقاطعات مولاي رشيد", "2018-08-20", 2018),

        # == ترابية Feb 2019 ==
        ("علي سالم الشكاف", "عامل", "ترابية", None,"إقليم مديونة",None, "2019-02-18", 2019),
        ("عمر التويمي", "عامل", "ترابية", None,"عمالة سلا", None,"2019-02-18", 2019),
        ("الحبيب ندير", "عامل", "ترابية", None,"إقليم سيدي قاسم",None, "2019-02-18", 2019), 
        ("محمد النشطي", "عامل", "ترابية", None,"عمالة الدار البيضاء","عمالة مقاطعات ابن مسيك", "2019-02-18", 2019), 
 
        # === ترابية (October 2023) ===
        ("محمد يعقوبي", "والي على جهة الرباط - سلا - القنيطرة، وعامل على عمالة الرباط", "ترابية", "جهة الرباط سلا القنيطرة", "عمالة الرباط",None, "2023-10-19", 2023),
        ("محمد امهيدية", "والي على جهة الدار البيضاء - سطات، وعامل على عمالة الدار البيضاء", "ترابية", "جهة الدار البيضاء سطات", "عمالة الدار البيضاء",None, "2023-10-19", 2023),    
        # === ترابية (May 2025) ===
        ("محمد علي حبوها", "عامل", "ترابية", None, "إقليم سطات",None, "2025-05-12", 2025),
        ("جمال خلوق", "عامل", "ترابية", None, "إقليم برشيد",None, "2025-05-12", 2025),
        ("عادل المالكي", "عامل", "ترابية", None, "عمالة المحمدية",None, "2025-05-12", 2025),
        ("الحسن بوكوتة", "عامل", "ترابية", None, "إقليم بنسليمان",None, "2025-05-12", 2025),
        ("سمير اليزيدي", "عامل", "ترابية", None, "إقليم قلعة السراغنة",None, "2025-05-12", 2025),
        ("محمد ضرهم", "عامل", "ترابية", None, "إقليم سيدي إفني",None, "2025-05-12", 2025),
        ("إبراهيم أبو زيد", "عامل", "ترابية", None, "إقليم صفرو",None, "2025-05-12", 2025),
        ("هشام المدغري العلوي", "عامل", "ترابية", None, "إقليم خريبكة",None, "2025-05-12", 2025),
        ("حميد اشنوري", "عامل", "ترابية", None, "إقليم بركان",None, "2025-05-12", 2025),
        ("محمد سالم الصبتي", "عامل", "ترابية", None, "إقليم اشتوكة أيت باها",None, "2025-05-12", 2025),
        ("نور الدين اوعبو", "عامل", "ترابية", None, "إقليم فجيج",None, "2025-05-12", 2025),
        ("محمد رشيد", "عامل", "ترابية", None, "إقليم الصويرة",None, "2025-05-12", 2025),
        ("منير هواري", "عامل", "ترابية", None, "إقليم سيدي بنور",None, "2025-05-12", 2025),
        ("بشرى برادي", "عامل", "ترابية", None, "عمالة الدار البيضاء","عمالة مقاطعة عين الشق","2025-05-12", 2025),
        ("عبد المومن طالب", "عامل", "ترابية", None, "إقليم اليوسفية",None, "2025-05-12", 2025),
        ("عمر المريني", "عامل", "ترابية", None, "إقليم الحاجب",None, "2025-05-12", 2025),
        ("محمد باري", "عامل", "ترابية", None, "إقليم طاطا",None, "2025-05-12", 2025),

        # === مكلف_مهمة (May 2025) ===
        ("يونس الخويلدي", "عامل مكلف بالشؤون الداخلية الجهوية", "مكلف_مهمة", "جهة الرباط سلا القنيطرة", None,None, "2025-05-12", 2025),
        ("والعيد المسافر", "عامل مكلف بالشؤون الداخلية الجهوية", "مكلف_مهمة", "جهة طنجة تطوان الحسيمة", None,None, "2025-05-12", 2025),
        ("حنان الرياحي", "عاملة مكلفة بالشؤون الداخلية الجهوية", "مكلف_مهمة", "جهة مراكش آسفي", None,None, "2025-05-12", 2025),
        ("حورية بلصيق", "عاملة على عمالة مقاطعة الحي الحسني بالدار البيضاء", "ترابية", "جهة الدار البيضاء سطات", "عمالة الدار البيضاء","عمالة مقاطعة الحي الحسني","2025-05-12", 2025),

        # === ترابية (October 2024) ===
        ("معاذ الجامعي", "والي على جهة فاس – مكناس، وعامل على عمالة فاس", "ترابية", "جهة فاس مكناس", "عمالة فاس",None, "2024-10-18", 2024),
        ("خطيب لهبيل", "والي على جهة الشرق، وعامل على عمالة وجدة أنجاد", "ترابية", "جهة الشرق", "عمالة وجدة أنكاد",None, "2024-10-18", 2024),
        ("السعيد زنيبر", "والي على جهة درعة – تافيلالت، وعامل على إقليم الرشيدية", "ترابية", "جهة درعة تافيلالت", "إقليم الرشيدية",None, "2024-10-18", 2024),
        ("محمد بنريباك", "والي على جهة بني ملال – خنيفرة، وعامل على إقليم بني ملال", "ترابية", "جهة بني ملال خنيفرة", "إقليم بني ملال",None, "2024-10-18", 2024),
        ("امحمد العطفاوي", "عامل على إقليم الجديدة", "ترابية", "جهة الدار البيضاء سطات", "إقليم الجديدة",None, "2024-10-18", 2024),
        ("المصطفى النوحي", "عامل على عمالة الصخيرات – تمارة", "ترابية", "جهة الرباط سلا القنيطرة", "عمالة الصخيرات تمارة",None, "2024-10-18", 2024),
        ("عبد الحميد المزيد", "عامل على عمالة القنيطرة", "ترابية", "جهة الرباط سلا القنيطرة", "عمالة القنيطرة",None, "2024-10-18", 2024),
        ("محمد فطاح", "عامل على إقليم آسفي", "ترابية", "جهة مراكش أسفي", "إقليم آسفي",None, "2024-10-18", 2024),
        ("مبروك تابت", "عامل على إقليم تارودانت", "ترابية", "جهة سوس ماسة", "إقليم تارودانت",None, "2024-10-18", 2024),
        ("محمد سمير الخمليشي", "عامل على إقليم مولاي يعقوب", "ترابية", "جهة فاس مكناس", "إقليم مولاي يعقوب",None, "2024-10-18", 2024),
        ("عبد الرحمان الجوهري", "عامل على إقليم تيزنيت", "ترابية", "جهة سوس ماسة", "إقليم تيزنيت",None, "2024-10-18", 2024),
        ("شكيب بلقايد", "عامل على إقليم جرادة", "ترابية", "جهة الشرق", "إقليم جرادة",None, "2024-10-18", 2024),
        ("حسن بنخيي", "عامل على إقليم أزيلال", "ترابية", "جهة بني ملال خنيفرة", "إقليم أزيلال",None, "2024-10-18", 2024),
        ("عبد الله شاطر", "عامل على إقليم طانطان", "ترابية", "جهة كلميم واد نون", "إقليم طانطان",None, "2024-10-18", 2024),
        ("محمد رشدي", "عامل على إقليم أوسرد", "ترابية", "جهة كلميم واد نون", "إقليم أوسرد",None, "2024-10-18", 2024),
        ("عبد الحق حمداوي", "عامل على عمالة مقاطعات الفداء-مرس السلطان", "ترابية", "جهة الدار البيضاء سطات","عمالة الدار البيضاء" ,"عمالة مقاطعات الفداء-مرس السلطان", "2024-10-18", 2024),
        ("عبد اللطيف النحلي", "عامل على إقليم الخميسات", "ترابية", "جهة الرباط سلا القنيطرة", "إقليم الخميسات",None, "2024-10-18", 2024),
        ("جلال بنحيون", "عامل على إقليم النواصر", "ترابية", "جهة الدار البيضاء سطات", "إقليم النواصر",None, "2024-10-18", 2024),
        ("إدريس مصباح", "عامل على إقليم إفران", "ترابية", "جهة فاس مكناس", "إقليم إفران", "2024-10-18",None, 2024),
        ("علال الباز", "عامل على إقليم بولمان", "ترابية", "جهة بني ملال خنيفرة", "إقليم بولمان",None, "2024-10-18", 2024),
        ("بدر بوسيف", "عامل على إقليم تاوريرت", "ترابية", "جهة الشرق", "إقليم تاوريرت",None, "2024-10-18", 2024),
        ("عبد السلام الحتاش", "عامل على إقليم جرسيف", "ترابية", "جهة الشرق", "إقليم جرسيف",None, "2024-10-18", 2024),
        ("عبد السلام فريندو", "عامل على إقليم الدريوش", "ترابية", "جهة الشرق", "إقليم الدريوش",None, "2024-10-18", 2024),
        ("محمد عادل إهوران", "عامل على إقليم خنيفرة", "ترابية", "جهة بني ملال خنيفرة", "إقليم خنيفرة",None, "2024-10-18", 2024),
        ("إدريس روبيو", "عامل على إقليم سيدي سليمان", "ترابية", "جهة الرباط سلا القنيطرة", "إقليم سيدي سليمان",None, "2024-10-18", 2024),
        ("عبد الوهاب فاضل", "عامل على إقليم ميدلت", "ترابية", "جهة درعة تافيلالت", "إقليم ميدلت",None, "2024-10-18", 2024),
        ("إبراهيم بوتوملات", "عامل على إقليم السمارة", "ترابية", "جهة العيون الساقية الحمراء", "إقليم السمارة",None, "2024-10-18", 2024),
        ("محمد الطاوس", "عامل على عمالة مقاطعات عين السبع الحي-المحمدي", "ترابية", "جهة الدار البيضاء سطات","عمالة الدار البيضاء", "عمالة مقاطعات عين السبع الحي-المحمدي", "2024-10-18", 2024),

    ]   
    for full_name, job_description, idara, jiha, wilaya, amala, assign_date, assign_year in appointments:
        #print('Processing: ', full_name, job_description, idara, jiha, wilaya, amala, assign_date, assign_year)
        # Handle special cases
        if idara == "مركزية":
            jiha_id = 0
            wilaya_id = 0
            amala_jamaa_id = 0
            amala = "مركزية"
        elif idara == "مكلف_مهمة":
            # Get jiha_id from jihate table
            result = db.execute(
                text("SELECT jiha_id FROM jihate WHERE jiha = :jiha LIMIT 1"),
                {"jiha": jiha}
            ).fetchone()
            jiha_id = result[0] if result else 100
            wilaya_id = 100
            amala_jamaa_id = 100
            amala = "مكلف_مهمة"
        else:
            jiha_id = None
            wilaya_id = None
            amala_jamaa_id = None
            # Case 1: Lookup in amalate_jamaate if amala is provided
            if amala_jamaa_id is None and amala:
                result = db.execute(
                    text("SELECT jiha_id, wilaya_id, amala_jamaa_id FROM amalate_jamaate WHERE amala_jamaa = :amala"),
                    {"amala": amala}
                ).fetchone()
                if result:
                    jiha_id, wilaya_id, amala_jamaa_id = result
            # Case 2: Regular wilaya lookup in jihate
            if jiha_id is None and wilaya:
                result = None
                # Primary lookup: (jiha, wilaya)
                if jiha:
                    result = db.execute(
                        text("SELECT jiha_id, wilaya_id FROM jihate WHERE jiha = :jiha AND wilaya = :wilaya"),
                        {"jiha": jiha, "wilaya": wilaya}
                    ).fetchone()

                # Fallback: lookup by wilaya only
                if not result:
                    result = db.execute(
                        text("SELECT jiha_id, wilaya_id FROM jihate WHERE wilaya = :wilaya"),
                        {"wilaya": wilaya}
                    ).fetchone()

                if result:
                    jiha_id, wilaya_id = result
            
            if jiha_id is None:
                print(f"Warning: No match for jiha='{jiha}', wilaya='{wilaya}' (Full name: {full_name})")
                continue    
        records.append(Woulate(
            full_name=full_name,
            job_title=extract_job_title(job_description),
            job_description=job_description,
            idara=idara,
            jiha_id=jiha_id,
            wilaya_id=wilaya_id,
            amala_jamaa_id = amala_jamaa_id if amala else None,
            amala=amala,
            assignment_date=assign_date,
            assignment_year=assign_year,
            active=True
        ))

    # Bulk insert
    for record in records:
        db.add(record)
    db.commit()
    print(f"Successfully imported {len(records)} records!")

    db.close()

if __name__ == "__main__":
    import_data()